alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F004_UINT32_0_to_FP32_mem_0.c
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 14                                                                      */
/* out_xy_comp 30                                                                   */
/* input0_select 30                                                                 */
/* out_zw_comp 30                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 15                                                                      */
/* out_xy_comp 31                                                                   */
/* input0_select 31                                                                 */
/* out_zw_comp 31                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/*  load multiple registers (0-63) from address 0x40                                */
/*  load constant registers (0-3) from address 0x300                                */
/*  load shader from address 0x400                                                  */
/*  set number of output registers                                                  */
/*  Set a single configuration register                                             */
/*  Start shader                                                                    */
/* unsigned int data_00000000[1024] = */ 
{
  0x00000040, 0x20400000, 0x00000300, 0x30040000 /* 0x0; */
, 0x00000400, 0x40100000, 0x0f000f33, 0x10000042 /* 0x10; */
, 0x00f03c00, 0x10000040, 0x01000001, 0x00000000 /* 0x20; */
, 0x00000000, 0x60000000, 0x00000000, 0x00000000 /* 0x30; */
, 0x00000200, 0x0010000b, 0x00000210, 0x0010000b /* 0x40; */
, 0x00000220, 0x0010000b, 0x00000230, 0x0010000b /* 0x50; */
, 0x00000240, 0x0010000b, 0x00000250, 0x0010000b /* 0x60; */
, 0x00000260, 0x0010000b, 0x00000270, 0x0010000b /* 0x70; */
, 0x00000280, 0x0010000b, 0x00000290, 0x0010000b /* 0x80; */
, 0x000002a0, 0x0010000b, 0x000002b0, 0x0010000b /* 0x90; */
, 0x000002c0, 0x0010000b, 0x000002d0, 0x0010000b /* 0xa0; */
, 0x000002e0, 0x0010000b, 0x000002f0, 0x0010000b /* 0xb0; */
, 0x00002000, 0x00100003, 0x00002010, 0x00100003 /* 0xc0; */
, 0x00002020, 0x00010003, 0x00002030, 0x00010003 /* 0xd0; */
, 0x00002040, 0x00010003, 0x00002050, 0x00010003 /* 0xe0; */
, 0x00002060, 0x00010003, 0x00002070, 0x00010003 /* 0xf0; */
, 0x00002080, 0x00010003, 0x00002090, 0x00010003 /* 0x100; */
, 0x000020a0, 0x00010003, 0x000020b0, 0x00010003 /* 0x110; */
, 0x000020c0, 0x00010003, 0x000020d0, 0x00010003 /* 0x120; */
, 0x000020e0, 0x00010003, 0x000020f0, 0x00010003 /* 0x130; */
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x00000000, 0x00000001, 0x00000002, 0x00000003 /* 0x200; */
, 0x00000004, 0x00000005, 0x00000006, 0x00000007 /* 0x210; */
, 0x00000008, 0x00000009, 0x0000000a, 0x0000000b /* 0x220; */
, 0x0000000c, 0x0000000d, 0x0000000e, 0x0000000f /* 0x230; */
, 0x00000010, 0x00000011, 0x00000012, 0x00000013 /* 0x240; */
, 0x00000014, 0x00000015, 0x00000016, 0x00000017 /* 0x250; */
, 0x00000018, 0x00000019, 0x0000001a, 0x0000001b /* 0x260; */
, 0x0000001c, 0x0000001d, 0x0000001e, 0x0000001f /* 0x270; */
, 0x0000000f, 0x000000f0, 0x00000f00, 0x0000f000 /* 0x280; */
, 0x000f0000, 0x00f00000, 0x0f000000, 0xf0000000 /* 0x290; */
, 0x7fffffff, 0x80000000, 0x80000008, 0x80000080 /* 0x2a0; */
, 0xfffffc00, 0xfffffc40, 0xfffffcc0, 0xfffffcff /* 0x2b0; */
, 0xfffffd00, 0xfffffd40, 0xfffffdc0, 0xfffffdff /* 0x2c0; */
, 0xfffffe00, 0xfffffe40, 0xfffffec0, 0xfffffeff /* 0x2d0; */
, 0xffffff00, 0xffffff40, 0xffffffc0, 0xfffffffb /* 0x2e0; */
, 0xfffffffc, 0xfffffffd, 0xfffffffe, 0xffffffff /* 0x2f0; */
, 0x3f2a6410, 0xbf3176b4, 0x3e8d8e95, 0x00000000 /* 0x300; */
, 0x3f2f70e6, 0x3f36e245, 0x3e10c5cc, 0x00000000 /* 0x310; */
, 0xbe974e6d, 0x3dc353b6, 0x3f735827, 0x00000000 /* 0x320; */
, 0x00000000, 0x00000000, 0x00000000, 0x3f800000 /* 0x330; */
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0xb00b0ec2, 0x400002c1, 0x40034400, 0x00001c08 /* 0x400; */
, 0xb00b0ec2, 0x440002c1, 0xc4034400, 0x00001c08 /* 0x410; */
, 0xb00b0ec2, 0x480002c1, 0x48034400, 0x00001c09 /* 0x420; */
, 0xb00b0ec2, 0x4c0002c1, 0xcc034400, 0x00001c09 /* 0x430; */
, 0xb00b0ec2, 0x500002c1, 0x50034400, 0x00001c0a /* 0x440; */
, 0xb00b0ec2, 0x540002c1, 0xd4034400, 0x00001c0a /* 0x450; */
, 0xb00b0ec2, 0x580002c1, 0x58034400, 0x00001c0b /* 0x460; */
, 0xb00b0ec2, 0x5c0002c1, 0xdc034400, 0x00001c0b /* 0x470; */
, 0xb00b0ec2, 0x600002c1, 0x60034400, 0x00001c0c /* 0x480; */
, 0xb00b0ec2, 0x640002c1, 0xe4034400, 0x00001c0c /* 0x490; */
, 0xb00b0ec2, 0x680002c1, 0x68034400, 0x00001c0d /* 0x4a0; */
, 0xb00b0ec2, 0x6c0002c1, 0xec034400, 0x00001c0d /* 0x4b0; */
, 0xb00b0ec2, 0x700002c1, 0x70034400, 0x00001c0e /* 0x4c0; */
, 0xb00b0ec2, 0x740002c1, 0xf4034400, 0x00001c0e /* 0x4d0; */
, 0xb00b0ec2, 0x780002c1, 0x78034400, 0x00001c0f /* 0x4e0; */
, 0xb00b0ec2, 0x7c0002c1, 0xfc034400, 0x00001c0f /* 0x4f0; */
},

/* ###################
 * START OF NEW MEMPAGE: 2 */
/* EMPTY PAGE */ 
/* unsigned int data_00002000[1024]; */ 
{0},

};
